app/Controllers/PengirimanController.php

			public function index()
			{
				$data['transaksi'] = $this->pengiriman->findAll();
---
SELECT *
FROM `transaksi`